Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.HeadingTextTypeId
Element id of text associated with legend heading.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.TextTypeId
Element id of text associated with legend body.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.#ctor(Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings)
Constructs a new copy of the input AnalysisDisplayLegendSettings object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011